* Question
:PROPERTIES:
:header-args:scheme: :eval no
:END:
With ~permanent-set!~ as described in exercise 4.51 and ~if-fail~ as in exercise 4.52, what will be the result of evaluating

#+begin_src scheme
  (let ((pairs '()))
    (if-fail (let ((p (prime-sum-pair '(1 3 5 8) '(20 35 110))))
               (permanent-set! pairs (cons p pairs))
               (amb))
             pairs))
#+end_src

* Answer
The expression accumulates prime pair sums in the given lists.

#+begin_src scheme :exports both
  ;; Load
  (load "4.52.ambeval.scm")
  ;; Test
  (mc-eval
   '(begin
      (define (prime-sum-pair list1 list2)
        (define (prime? n)
          (define (divides? a b)
            (= (remainder b a) 0))
          (define (square x) (* x x))
          (define (find-divisor n test-divisor)
            (cond ((> (square test-divisor) n) n)
                  ((divides? test-divisor n) test-divisor)
                  (else (find-divisor n (+ test-divisor 1)))))
          (define (smallest-divisor n)
            (find-divisor n 2))
          (= n (smallest-divisor n)))
        (let ((a (an-element-of list1))
              (b (an-element-of list2)))
          (require (prime? (+ a b)))
          (list a b)))
      (let ((pairs '()))
        (if-fail (let ((p (prime-sum-pair '(1 3 5 8) '(20 35 110))))
                   (permanent-set! pairs (cons p pairs))
                   (amb))
                 pairs))))
#+end_src

#+RESULTS:
| 8 |  35 |
| 3 | 110 |
| 3 |  20 |
